month = ["", "январь", "февраль", "март", "апрель", "май", "июнь", "июль", "август", "сентябрь", "октябрь", "ноябрь",
         "декабрь"]
season = {1: "зимы", 2: "зимы", 3: "весны", 4: "весны", 5: "весны", 6: "лета", 7: "лета", 8: "лета", 9: "осени",
          10: "осени", 11: "осени", 12: "зимы"}
num_month = int(input("Введите месяц цифрой от 1 до 12: "))
while num_month > 12:
    print("Такого месяца не существует. Попробуйте еще раз.")
    num_month = int(input("Введите месяц цифрой от 1 до 12: "))
print(f"{month[num_month]} месяц {season[num_month]}")
